Lambosaurus/STM32X/Lib/usb/mtp/MTP_Defs.h
#define MTP_OBJ_NO_PROTECTION                              0x0000
#define MTP_OBJ_READ_ONLY                                  0x0001
#define MTP_OBJ_READ_ONLY_DATA                             0x8002
#define MTP_OBJ_NON_TRANSFERRABLE_DATA                     0x8003

// Device properties
#define MTP_DEV_PROP_UNDEFINED                             0x5000
#define MTP_DEV_PROP_BATTERY_LEVEL                         0x5001
#define MTP_DEV_PROP_FUNCTIONAL_MODE                       0x5002
#define MTP_DEV_PROP_IMAGE_SIZE                            0x5003
#define MTP_DEV_PROP_COMPRESSION_SETTING                   0x5004
#define MTP_DEV_PROP_WHITE_BALANCE                         0x5005
#define MTP_DEV_PROP_RGB_GAIN                              0x5006
#define MTP_DEV_PROP_F_NUMBER                              0x5007
#define MTP_DEV_PROP_FOCAL_LENGTH                          0x5008
#define MTP_DEV_PROP_FOCUS_DISTANCE                        0x5009
#define MTP_DEV_PROP_FOCUS_MODE                            0x500A
#define MTP_DEV_PROP_EXPOSURE_METERING_MODE                0x500B
#define MTP_DEV_PROP_FLASH_MODE                            0x500C
#define MTP_DEV_PROP_EXPOSURE_TIME                         0x500D
#define MTP_DEV_PROP_EXPOSURE_PROGRAM_MODE                 0x500E
#define MTP_DEV_PROP_EXPOSURE_INDEX                        0x500F
#define MTP_DEV_PROP_EXPOSURE_BIAS_COMPENSATION            0x5010
#define MTP_DEV_PROP_DATETIME                              0x5011
#define MTP_DEV_PROP_CAPTURE_DELAY                         0x5012
#define MTP_DEV_PROP_STILL_CAPTURE_MODE                    0x5013
#define MTP_DEV_PROP_CONTRAST                              0x5014
#define MTP_DEV_PROP_SHARPNESS                             0x5015
#define MTP_DEV_PROP_DIGITAL_ZOOM                          0x5016
#define MTP_DEV_PROP_EFFECT_MODE                           0x5017
#define MTP_DEV_PROP_BURST_NUMBER                          0x5018
#define MTP_DEV_PROP_BURST_INTERVAL                        0x5019
#define MTP_DEV_PROP_TIMELAPSE_NUMBER                      0x501A
#define MTP_DEV_PROP_TIMELAPSE_INTERVAL                    0x501B
#define MTP_DEV_PROP_FOCUS_METERING_MODE                   0x501C
#define MTP_DEV_PROP_UPLOAD_URL                            0x501D
#define MTP_DEV_PROP_ARTIST                                0x501E
#define MTP_DEV_PROP_COPYRIGHT_INFO                        0x501F
#define MTP_DEV_PROP_SYNCHRONIZATION_PARTNER               0xD401
#define MTP_DEV_PROP_DEVICE_FRIENDLY_NAME                  0xD402
#define MTP_DEV_PROP_VOLUME                                0xD403
#define MTP_DEV_PROP_SUPPORTEDFORMATSORDERED               0xD404
#define MTP_DEV_PROP_DEVICEICON                            0xD405
#define MTP_DEV_PROP_PLAYBACK_RATE                         0xD410
#define MTP_DEV_PROP_PLAYBACK_OBJECT                       0xD411
#define MTP_DEV_PROP_PLAYBACK_CONTAINER                    0xD412
#define MTP_DEV_PROP_SESSION_INITIATOR_VERSION_INFO        0xD406
#define MTP_DEV_PROP_PERCEIVED_DEVICE_TYPE                 0xD407

// Operation codes
#define MTP_OP_GET_DEVICE_INFO                             0x1001
#define MTP_OP_OPEN_SESSION                                0x1002
#define MTP_OP_CLOSE_SESSION                               0x1003
#define MTP_OP_GET_STORAGE_IDS                             0x1004
#define MTP_OP_GET_STORAGE_INFO                            0x1005
#define MTP_OP_GET_NUM_OBJECTS                             0x1006
#define MTP_OP_GET_OBJECT_HANDLES                          0x1007
#define MTP_OP_GET_OBJECT_INFO                             0x1008
#define MTP_OP_GET_OBJECT                                  0x1009
#define MTP_OP_GET_THUMB                                   0x100A
#define MTP_OP_DELETE_OBJECT                               0x100B
#define MTP_OP_SEND_OBJECT_INFO                            0x100C
#define MTP_OP_SEND_OBJECT                                 0x100D
#define MTP_OP_FORMAT_STORE                                0x100F
#define MTP_OP_RESET_DEVICE                                0x1010
#define MTP_OP_GET_DEVICE_PROP_DESC                        0x1014
#define MTP_OP_GET_DEVICE_PROP_VALUE                       0x1015
#define MTP_OP_SET_DEVICE_PROP_VALUE                       0x1016
#define MTP_OP_RESET_DEVICE_PROP_VALUE                     0x1017
#define MTP_OP_TERMINATE_OPEN_CAPTURE                      0x1018
#define MTP_OP_MOVE_OBJECT                                 0x1019
#define MTP_OP_COPY_OBJECT                                 0x101A
#define MTP_OP_GET_PARTIAL_OBJECT                          0x101B
#define MTP_OP_INITIATE_OPEN_CAPTURE                       0x101C
#define MTP_OP_GET_OBJECT_PROPS_SUPPORTED                  0x9801
#define MTP_OP_GET_OBJECT_PROP_DESC                        0x9802
#define MTP_OP_GET_OBJECT_PROP_VALUE                       0x9803
#define MTP_OP_SET_OBJECT_PROP_VALUE                       0x9804
#define MTP_OP_GET_OBJECT_PROPLIST                         0x9805
#define MTP_OP_GET_OBJECT_REFERENCES                       0x9810
#define MTP_OP_GETSERVICEIDS                               0x9301
#define MTP_OP_GETSERVICEINFO                              0x9302
#define MTP_OP_GETSERVICECAPABILITIES                      0x9303
#define MTP_OP_GETSERVICEPROPDESC                          0x9304

// Response codes
#define MTP_RESP_OK                                        0x2001
#define MTP_RESP_GENERAL_ERROR                             0x2002
#define MTP_RESP_SESSION_NOT_OPEN                          0x2003
#define MTP_RESP_OPERATION_NOT_SUPPORTED                   0x2005
#define MTP_RESP_PARAMETER_NOT_SUPPORTED                   0x2006
#define MTP_RESP_INCOMPLETE_TRANSFER                       0x2007
#define MTP_RESP_INVALID_STORAGE_ID                        0x2008
#define MTP_RESP_INVALID_OBJECT_HANDLE                     0x2009
#define MTP_RESP_DEVICEPROP_NOT_SUPPORTED                  0x200A
#define MTP_RESP_INVALID_OBJECT_FORMAT_CODE                0x200B
#define MTP_RESP_STORE_FULL                                0x200C
#define MTP_RESP_OBJECT_WRITE_PROTECTED                    0x200D
#define MTP_RESP_STORE_READ_ONLY                           0x200E
#define MTP_RESP_ACCESS_DENIED                             0x200F
#define MTP_RESP_STORE_NOT_AVAILABLE                       0x2013
#define MTP_RESP_SPECIFICATION_BY_FORMAT_NOT_SUPPORTED     0x2014
#define MTP_RESP_NO_VALID_OBJECT_INFO                      0x2015
#define MTP_RESP_DEVICE_BUSY                               0x2019
#define MTP_RESP_INVALID_PARENT_OBJECT                     0x201A
#define MTP_RESP_INVALID_PARAMETER                         0x201D
#define MTP_RESP_SESSION_ALREADY_OPEN                      0x201E
#define MTP_RESP_TRANSACTION_CANCELLED                     0x201F
#define MTP_RESP_INVALID_OBJECT_PROP_CODE                  0xA801
#define MTP_RESP_INVALID_DATASET                           0xA806
#define MTP_RESP_SPECIFICATION_BY_GROUP_UNSUPPORTED        0xA807
#define MTP_RESP_SPECIFICATION_BY_DEPTH_UNSUPPORTED        0xA808
#define MTP_RESP_OBJECT_TOO_LARGE                          0xA809
#define MTP_RESP_OBJECT_PROP_NOT_SUPPORTED                 0xA80A


// Event codes
#define MTP_EVENT_UNDEFINED                                0x4000
#define MTP_EVENT_CANCELTRANSACTION                        0x4001
#define MTP_EVENT_OBJECTADDED                              0x4002
#define MTP_EVENT_OBJECTREMOVED                            0x4003
#define MTP_EVENT_STOREADDED                               0x4004
#define MTP_EVENT_STOREREMOVED                             0x4005
#define MTP_EVENT_DEVICEPROPCHANGED                        0x4006
#define MTP_EVENT_OBJECTINFOCHANGED                        0x4007
#define MTP_EVENT_DEVICEINFOCHANGED                        0x4008
#define MTP_EVENT_REQUESTOBJECTTRANSFER                    0x4009
#define MTP_EVENT_STOREFULL                                0x400A
#define MTP_EVENT_DEVICERESET                              0x400B
#define MTP_EVENT_STORAGEINFOCHANGED                       0x400C
#define MTP_EVENT_CAPTURECOMPLETE                          0x400D
#define MTP_EVENT_UNREPORTEDSTATUS                         0x400E
#define MTP_EVENT_OBJECTPROPCHANGED                        0xC801
#define MTP_EVENT_OBJECTPROPDESCCHANGED                    0xC802
#define MTP_EVENT_OBJECTREFERENCESCHANGED                  0xC803

// Container Types
#define MTP_CONT_TYPE_UNDEFINED                            0
#define MTP_CONT_TYPE_COMMAND                              1
#define MTP_CONT_TYPE_DATA                                 2
#define MTP_CONT_TYPE_RESPONSE                             3
#define MTP_CONT_TYPE_EVENT                                4


