Lambosaurus/STM32X/Lib/usb/mtp/MTP_Defs.h
#define MTP_SPACE_IN_OBJ_NOT_USED                          0xFFFFFFFF

// MTP storage type
#define MTP_STORAGE_UNDEFINED                              0x0000
#define MTP_STORAGE_FIXED_ROM                              0x0001
#define MTP_STORAGE_REMOVABLE_ROM                          0x0002
#define MTP_STORAGE_FIXED_RAM                              0x0003
#define MTP_STORAGE_REMOVABLE_RAM                          0x0004

// MTP file system type
#define MTP_FILESYSTEM_UNDEFINED                           0x0000
#define MTP_FILESYSTEM_GENERIC_FLAT                        0x0001
#define MTP_FILESYSTEM_GENERIC_HIERARCH                    0x0002
#define MTP_FILESYSTEM_DCF                                 0x0003

// MTP access capability
#define MTP_ACCESS_CAP_RW                                  0x0000
#define MTP_ACCESS_CAP_RO_WITHOUT_DEL                      0x0001
#define MTP_ACCESS_CAP_RO_WITH_DEL                         0x0002


// Packet sizes
#define MTP_OPERATION_SIZE					sizeof(MTP_Operation_t)
#define MTP_CONT_HEADER_SIZE				12
#define MTP_CMD_SIZE						8
#define MTP_MEDIA_PACKET					512


// Could be 255. Lets limit it to this anyway.
#define MTP_STRING_MAX						64

/*
 * PUBLIC TYPES
 */

typedef struct __attribute((packed)) {
	uint32_t length;
	uint16_t type;
	uint16_t code;
	uint32_t transaction_id;
	uint32_t param[5];
} MTP_Operation_t;

typedef struct __attribute((packed)) {
	uint32_t length;
	uint16_t type;
	uint16_t code;
	uint32_t transaction_id;
	uint8_t  data[MTP_MEDIA_PACKET];
	uint32_t packet_size;
} MTP_Container_t;

/*
 * PUBLIC FUNCTIONS
 */

/*
 * EXTERN DECLARATIONS
 */

#endif //MTP_DEFS_H
